from db.session import *
from crud import create
import os
from datetime import datetime
from pytz import timezone

db_session = next(get_db())

# part=update.part_info(db=db_session,part_id=33,p_08="보웬병-편평상피암")
# print(part)
part_dic = {
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_대장암_전문의검수_ver01":[5400,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_유방암_전문의검수_ver01":[5400,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_폐암_전문의검수_ver01":[2400,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_간암_전문의검수_ver01":[5400,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_위암_전문의검수_ver01":[4200,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_전립선암_전문의검수_ver01":[4200,"20221213","20231229"],
    
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_대장암_가공_ver01":[5400,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_대장암_검수_ver01":[5400,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_유방암_가공_ver01":[5400,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_유방암_검수_ver01":[5400,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_폐암_가공_ver01":[2400,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_폐암_검수_ver01":[2400,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_간암_가공_ver01":[5400,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_간암_검수_ver01":[5400,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_위암_가공_ver01":[4200,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_위암_검수_ver01":[4200,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_전립선암_가공_ver01":[4200,"20221213","20231229"],
    # "자체수주_용역_삼성서울병원_의료_병리_6대암_전립선암_검수_ver01":[4200,"20221213","20231229"],
    # "내부사업_RnD_주식회사서르_환경_재활용_생활폐기물_Study_수집_ver01":[200000,"20221214","20221231"]
    # "내부사업_RnD_주식회사서르_환경_재활용_생활폐기물_Class-56_가공_ver01":[24701,"20221201","20221231"]
    #"자체수주_RnD_주식회사캡토스_의료_캡슐내시경_골든데이터셋_병변_가공_ver01":[408156,"20221104","20230630"],
    #"정부사업_NIA_주식회사서르_환경_재활용_재활용_아노테이션_정제검수_ver01":[186781,"20221017","20221031"],
    # "자체수주_용역_서울대학교병원_의료_도구_ETRI_Yellowbox_가공_ver01":[124,"20220928","20221007"],
    # "자체수주_용역_서울대학교병원_의료_도구_ETRI_Bluebox_가공_ver01":[81,"20220928","20221007"]
    # "자체수주_RnD_주식회사캡토스_의료_캡슐내시경_카자흐스탄_병변_가공_ver02":[300000,"20220920","20221130"],
    # "자체수주_RnD_주식회사캡토스_의료_캡슐내시경_카자흐스탄_병변_검수_ver02":[300000,"20220920","20221130"],
    #"위탁사업_IITP_주식회사사맛디_디자인_인테리어_공간_속성_가공_ver02":[30778,"20220901","20220930"],
    # "정부사업_NIA_주식회사서르_환경_재활용_재활용_아노테이션_정제_ver01":[500000,"20220816","20221028"],
        # "정부사업_NIA_서울대학교병원_의료_병리_피부_표피낭종_전문의검수_ver01":[7000,"20220817","20221028"],
        # "정부사업_NIA_서울대학교병원_의료_병리_피부_지루각화증_전문의검수_ver01":[7000,"20220817","20221028"],
        # "정부사업_NIA_서울대학교병원_의료_병리_피부_보웬병-편팡상피암_전문의검수_ver01":[7000,"20220817","20221028"],
        # "정부사업_NIA_서울대학교병원_의료_병리_피부_기저세포암_전문의검수_ver01":[7000,"20220817","20221028"],
        # "정부사업_NIA_서울대학교병원_의료_병리_피부_멜라닌세포모반_전문의검수_ver01":[7000,"20220817","20221028"],
        # "정부사업_NIA_서울대학교병원_의료_병리_피부_흑색종_전문의검수_ver01":[5700,"20220817","20221028"],
    # "자체수주_AI바우처_주식회사집꾸미기_디자인_인테리어_재료_속성_검수_ver01":[22000,"20220725","20220728"],
#     # "자체수주_RnD_주식회사캡토스_의료_캡슐내시경_카자흐스탄_병변_가공_ver01":[100000,"20220701","20221118"],
#     # "자체수주_RnD_주식회사캡토스_의료_캡슐내시경_카자흐스탄_병변_검수_ver01":[100000,"20220725","20221125"],
#     # "자체수주_RnD_주식회사캡토스_의료_캡슐내시경_카자흐스탄_위치_가공_ver01":[50000,"20220711","20221118"],
#     # "자체수주_AI바우처_주식회사집꾸미기_디자인_인테리어_감성_세그멘테이션_정제_ver01":[4000,"20220711","20220720"],
#     # "자체수주_AI바우처_주식회사집꾸미기_디자인_인테리어_방타입_세그멘테이션_정제_ver01":[4000,"20220711","20220720"],
#     # "자체수주_AI바우처_주식회사집꾸미기_디자인_인테리어_재료_세그멘테이션_가공_ver01":[5000,"20220711","20220714"],
#     # "자체수주_AI바우처_주식회사집꾸미기_디자인_인테리어_재료_속성_가공_ver01":[5000,"20220715","20220720"],
#     #"자체수주_AI바우처_주식회사집꾸미기_디자인_인테리어_가구_세그멘테이션_정제_ver02":[22000,"20220629","20220713"],
#     #"자체수주_AI바우처_주식회사집꾸미기_디자인_인테리어_가구_세그멘테이션_정제_ver01":[80000,"20220616","20220708"],
#     # "위탁사업_IITP_주식회사사맛디_디자인_인테리어_공간_세그멘테이션_가공_ver01":[37000,"20220607","20220715"],
#     # "위탁사업_IITP_주식회사사맛디_디자인_인테리어_공간_세그멘테이션_검수_ver01":[37000,"20220609","20220719"],
#     # "위탁사업_IITP_주식회사사맛디_디자인_인테리어_공간_속성_가공_ver01":[37000,"20220720","20220802"],
#     # "위탁사업_IITP_주식회사사맛디_디자인_인테리어_공간_속성_검수_ver01":[37000,"20220725","20220805"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_정상_정제_ver01":[5000,"20220502","20220930"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_표피낭종_가공_ver01":[5000,"20220523","20221014"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_지루각화증_가공_ver01":[5000,"20220523","20221014"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_보웬병-편팡상피암_가공_ver01":[5000,"20220523","20221014"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_기저세포암_가공_ver01":[5000,"20220523","20221014"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_멜라닌세포모반_가공_ver01":[5000,"20220523","20221014"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_흑색종_가공_ver01":[5000,"20220523","20221014"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_표피낭종_검수_ver01":[5000,"20220530","20221021"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_지루각화증_검수_ver01":[5000,"20220530","20221021"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_보웬병-편팡상피암_검수_ver01":[5000,"20220530","20221021"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_기저세포암_검수_ver01":[5000,"20220530","20221021"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_멜라닌세포모반_검수_ver01":[5000,"20220530","20221021"],
#     # "정부사업_NIA_서울대학교병원_의료_병리_피부_흑색종_검수_ver01":[5000,"20220530","20221021"],
#     # "자체수주_데이터바우처_주식회사캡토스_의료_캡슐내시경_크바시르_병변_가공_ver01":[2500,"20220601","20220930"],
#     # "자체수주_데이터바우처_주식회사캡토스_의료_캡슐내시경_크바시르_병변_검수_ver01":[2500,"20220601","20220930"],
#     # "자체수주_데이터바우처_주식회사캡토스_의료_캡슐내시경_크바시르_위치_정제_ver01":[50000,"20220601","20220930"],
}
user_dic=[
    # [2022122601,"진승언","크라우드","ya7016@naver.com"]
    # [2022122207,"허민환","크라우드","dkvkxmsms@gmail.com"],
    # [2022122208,"이윤혜","크라우드","dorecord@naver.com"],
    # [2022122201,"박지영","크라우드","qlsrnrdkr@hanmail.net"],
    # [2022122202,"여창선","크라우드","ycsuny@naver.com"],
    # [2022122203,"김민지","크라우드","awds726@gmail.com"],
    # [2022122204,"최진태","크라우드","jtc419@naver.com"],
    # [2022122205,"이임재","크라우드","eelr0841@naver.com"],
    # [2022122206,"김고은","크라우드","hi-re@naver.com"],
    # [2022122101,"박혜경","크라우드","phk1321@naver.com"],
    # [2022122102,"이지혜","크라우드","hookin0131@naver.com"],
    # [2022122103,"양문희","크라우드","didansgml2@naver.com"],
    # [2022122104,"김민혜","크라우드","sara3297@naver.com"],
    # [2022122105,"박난희","크라우드","nanhee1613@nate.com"],
    # [2022122106,"박경은","크라우드","kyoung670@naver.com"],
    # [2022122107,"김혜진","크라우드","dgjdl@naver.com"],
    # [2022122108,"이경란","크라우드","kr9202@naver.com"],
    # [2022122109,"성하라","크라우드","zkdytpq@naver.com"],
    # [2022121502,"신연선","크라우드","prada2513028@naver.com"]
    # [2022121501,"김수정","크라우드","dearro35@naver.com"]
    # [2022121401,"이윤서","크라우드","2youndol@naver.com"],
    # [2022121402,"임가희","크라우드","dkdltm4597@daum.net"],
    # [2022121201,"정기태","크라우드","elite0101@naver.com"],
    # [2022121202,"박미화","크라우드","luck3539@naver.com"],
    # [2022121301,"신재영","크라우드","ddh04161@naver.com"],
    # [2022121302,"고다정","크라우드","god_jey@naver.com"],
    # [2022121303,"정새롬","크라우드","mandy_0301@naver.com"],
    # [2022121304,"정국영","크라우드","jrnrdud1@naver.com"],
    # [2022121305,"조해문","크라우드","goans91@naver.com"],
    # [2022121306,"신정은","크라우드","0730jjungeun@naver.com"],
    # [2022121307,"강진미","크라우드","loq8765432l@naver.com"],
    # [2022121308,"김하나","크라우드","54477786@hanmail.net"],
    #[2022120501,"한은비","아르바이트","apdlvmf1017@naver.com"]
    # [2022120101,"이은비","아르바이트","moment022701@naver.com"]
    # [2022112401,"배찬우","아르바이트","thisisehanwoo@naver.com"]
    #[2022112304,"문진욱","아르바이트","moonjin1873@naver.com"]
    # [2022112301,"김명량","아르바이트","qwe3917@naver.com"],
    # [2022112302,"김태호","아르바이트","th2663@naver.com"],
    # [2022112303,"김민선","아르바이트","kmstop8026@gmail.com"],
    # [2022112201,"최혜은","아르바이트","dms2920@naver.com"]
    # [2022110401,"최찬미","아르바이트","minho5361@naver.com"],
    # [2022110701,"정다은","아르바이트","de01119@naver.com"],
    # [2022110301,"박주현","아르바이트","wngus3409@naver.com"],
    # [2022110302,"양유진","아르바이트","yujinyang@gmail.com"],
    # [2022110303,"이혜민","크라우드","dbrgkrsusfqks@hanmail.net"],
    # [2022110304,"편천경","크라우드","ph462@hanmail.net"],
    # [2022110305,"서원우","크라우드","sww092@naver.com"],
    # [2022110306,"김민정2","크라우드","mjmj7100@naver.com"],
    # [2022110307,"권미연","크라우드","lyg133@naver.com"],
    # [2022110201,"박윤영","크라우드","saranglszl@naver.com"],
    # [2022110202,"차예슬","크라우드","cha2836@nate.com"],
    # [2022110203,"허보련","크라우드","gjqhfus@naver.com"],
    # [2022110204,"박보은","크라우드","Bonnieyaa25@gmail.com"],
    # [2022110205,"서예정","크라우드","spinkmonopoly@naver.com"],
    # [2022101101,"정아현","아르바이트","jhgus3515@gmail.com"],
    # [2022101102,"조해윤","아르바이트","hae994@naver.com"],
    # [2022101103,"최진주","아르바이트","wlswnfk5@naver.com"],
    # [2022092801,"박수익","아르바이트","tndlr1742@naver.com"],
    # [2022092601,"김수빈","아르바이트","sj7238@naver.com"],
    # [2022092602,"이익재","아르바이트","wla2735888@naver.com"]
    # [2022092301,"김택훈","아르바이트","hoontheking98@naver.com"]
    # [2022092001,"박유빈","아르바이트","pyb2424@naver.com"],
    # [2022090501,"이수현","아르바이트","ggoobda@gmail.com"],
    # [2022092101,"백수진","아르바이트","tutu0454@gmail.com"],
    # [2022081201,"변예슬","아르바이트","th_0927@naver.com"],
    # [2022082201,"전수민","아르바이트","kyafall90172@gmail.com"],
    # [2022082301,"권정주","아르바이트","lizzy930504@gmail.com"],
    # [2022082401,"하선연","아르바이트","hsy940609@naver.com"],
    # [2022090801,"윤희서","아르바이트","younhs0730@gmail.com"],
    # [2022090201,"이세란","아르바이트","ranse0388@gmail.com"],
    # [2022090202,"전현영","아르바이트","pipi0331@naver.com"],
    # [2022090101,"손현주","아르바이트","zoercool@naver.com"],
    # [2022090102,"이창진","아르바이트","mootee@naver.com"],
    # [2022080101,"조준영","아르바이트","whwnsdud21@naver.com"],
    # [2022080102,"김근모","아르바이트","rlarmsah02@naver.com"],
    # [2022080103,"손용국","아르바이트","syg1186@naver.com"],
    # [2022072001,"박승현","운영","sh_p@seoreu.com"],
    # [2022072601,"김주성","아르바이트","faxlore@naver.com"],
    # [2022071401,"양승희","아르바이트","hui_01@naver.com"],
    # [2022071402,"이슬인","아르바이트","tmfdls128@naver.com"],
    # [2022071403,"황혜성","아르바이트","hyesung9818@naver.com"],
    # [2022071801,"엄태주","아르바이트","djaxown407@naver.com"],
    # [2022060203,"김지운","개발","kim_jw@seoreu.com"],
    # [2022062001,"김은지","아르바이트","gracekim97@gmail.com"],
    # [2022071201,"이예린","아르바이트","ylin9901@naver.com"],
    #[2022071202,"하지원","아르바이트","99gkwldnjs99@naver.com"],
    # [2022070101,"박혜린","아르바이트","cnsgid1995@naver.com"],
    # [2022070401,"강수연","아르바이트","suyeon6584@naver.com"],
    # [2022070102,"이연주","아르바이트","kitezoo16@nacer.com"],
    # [2022070103,"백지현","아르바이트","c1516@naver.com"],
    # [2022070104,"신민정","아르바이트","tlsalswjd30@nacer.com"],
    # [2022070105,"홍지원","아르바이트","ghdwldnjs1529@naver.com"],
    # [2022070106,"박수진","아르바이트","6220psjj@gmail.com"],
    # [2022070107,"권진욱","아르바이트","rnjs6834@naver.com"],
    # [2022070108,"김보성","아르바이트","bosung0620@naver.com"],
    # [2022070109,"김주현","아르바이트","wngus7055@gmail.com"],
    # [2022070110,"김지훈","아르바이트","ibsgpdc@naver.com"],
    #[2022062901,"정진현","아르바이트","wlsgus1601@naver.com"],
    # [2022062301,"심정훈","아르바이트","losblancos19020306@gmail.com"],
    # [2022062801,"김성준","아르바이트","rr3131@naver.com"],
    # [2022062802,"김소민","아르바이트","mintlime77@naver.com"],
    #[2022062701,"공지원","아르바이트","rhdwldnjs656@naver.com"],
    #[20220622,"조혜지","아르바이트","jiji389364@gmail.com"],
    #[2022061603,"이지현","기획","l_jh@seoreu.com"],
    # [2022061601,"권정하","아르바이트","everwjdgk@naver.com"],
    # [2022061602,"정혜윤","아르바이트","jhy8000@naver.com"],
    #[2022061401,"유선준","아르바이트","yseonjun92@gmail.com"],
    #[2022061001,"김소정","아르바이트","rlathwjd1027@naver.com"],
    # [2022053001,"이도경","아르바이트","ehrud3220@naver.com"],
    # [2022060201,"손효경","아르바이트","jrshk@naver.com"],
    # [2022060801,"김미혜","아르바이트","vowov0525@naver.com"],
# [2019070101,"이종혁","CEO","jhlee@seoreu.com"],
# [2019081902,"박수현","Annotation","su_hyeon@seoreu.com"],
# [2019081904,"황수철","운영","soo_cheol@seoreu.com"],
# [2019090201,"박정서","Annotation","jeong_seo@seoreu.com"],
# [2019092301,"박지애","운영","ji_ae@seoreu.com"],
# [2020010204,"민덕기","Annotation","min_dg@seoreu.com"],
# [2020031802,"심효정","Annotation","shim_hj@seoreu.com"],
# [2020040101,"전승혁","운영","jeon_sh@seoreu.com"],
# [2020090203,"류연경","Annotation","yg_ryu@seoreu.com"],
# [2020120101,"최태훈","개발","choi_th@seoreu.com"],
# [2021053103,"신혜진","Annotation","shin_hj@seoreu.com"],
# [2021060103,"김소희","개발","greensohee@samatti.com"],
# [2021090103,"최영준","Annotation","choi_yj@seoreu.com"],
# [2021110204,"남상민","개발","nam_sm@seoreu.com"],
# [2021120101,"안경민","기획","ahn_km@seoreu.com"],
# [2022012101,"주정우","개발","veryju@gmail.com"],
# [2022020101,"오창영","개발","ryan.oh@samatti.com"],
# [2022020102,"윤종민","개발","yoon.jm@samatti.com"],
# [2022030201,"이주희","운영","lee_jh@seoreu.com"],
# [2022050101,"이예슬","기획","lee_ys@seoreu.com"],
# [2022050102,"유승균","개발","yoon_sg@seoreu.com"],
# [2022050201,"김주리","아르바이트","orolcl1013@naver.com"],
# [2022050202,"박성수","아르바이트","uuuu0602@naver.com"],
# [2022050204,"장한송이","아르바이트","jhse4725@gmail.com"],
# [2022050205,"장재원","아르바이트","wjdwo2808@gmail.com"],
# [2022050206,"한결","아르바이트","iridum9.9@gmail.com"],
# [2022051101,"김혜영","아르바이트","lwj81645@naver.com"],
# [2022051601,"한준구","아르바이트","hongmouse95@gmail.com"],
# [2022052501,"임용조","아르바이트","ilysmf1@gmail.com"],
# [2022052502,"백주연","아르바이트","ppjuy@naver.com"],
# [2022052503,"심규리","아르바이트","kury0202@naver.com"],
# [2022053101,"주형진","아르바이트","cnn1502@gmail.com"]
]

# for part_name,value in part_dic.items():
#     create.part(db=db_session,p_02=part_name.split("_")[0],p_03=part_name.split("_")[1],p_04=part_name.split("_")[2],p_05=part_name.split("_")[3],p_06=part_name.split("_")[4],p_07=part_name.split("_")[5],p_08=part_name.split("_")[6],p_09=part_name.split("_")[7],p_10=part_name.split("_")[8],
#     max_count = value[0],start_date=value[1],end_date=value[2])
# def user(
#     *,
#     db : Session,
#     Employee_number:str,
#     Name:str,
#     email:str,
#     field:str
# ):

# def error_list(
#     *,
#     db : Session,
#     error:str
# ):
# error_list = ["Creck result","Result_format_error","Not_raw","Label_error"]
# for error_name in error_list:
#     create.error_list(db=db_session,error=error_name)
# print(user_dic)
# for user in user_dic:
#     print(user)
#     try:
#         result=create.user(db=db_session,Employee_number=str(user[0]),Name=user[1],email=user[3],field=user[2])
#         print(result)
#     except Exception as e:
#         print(e)

# department_list = ['아르바이트',"admin","사업총괄","경영지원","개발","기획","Annotation"]
# position_list = ['아르바이트',"admin","대표이사","팀장","과장","대리","사원","책임연구원","선임연구원","연구원"]
# for department in department_list:
#     create.department(db=db_session,department=department)
# for position in position_list:
#     create.position(db=db_session,position=position)


timezone = timezone('Asia/Seoul')
# print(timezone.localize(datetime.strptime('2019-07-01 00:00:00', '%Y-%m-%d %H:%M:%S')))
user_list = [
    #[2019070102,"Admin","admin","admin","seoreu@seoreu.com"]
    #[2019070101,"이종혁","사업총괄","대표이사","jhlee@seoreu.com"]
    [2019081902,"박수현","Annotation","사원","su_hyeon@seoreu.com"],
    [2019081904,"황수철","경영지원","대리","soo_cheol@seoreu.com"],
    [2019090201,"박정서","Annotation","사원","jeong_seo@seoreu.com"],
    [2019092301,"박지애","경영지원","대리","ji_ae@seoreu.com"],
    [2020010204,"민덕기","Annotation","사원","min_dg@seoreu.com"],
    [2020031802,"심효정","Annotation","사원","shim_hj@seoreu.com"],
    [2020040101,"전승혁","경영지원","팀장","jeon_sh@seoreu.com"],
    [2020090203,"류연경","Annotation","사원","yg_ryu@seoreu.com"],
    [2020120101,"최태훈","개발","연구원","choi_th@seoreu.com"],
    [2021053103,"신혜진","Annotation","사원","shin_hj@seoreu.com"],
    [2021090103,"최영준","Annotation","사원","choi_yj@seoreu.com"],
    [2021120101,"안경민","기획","사원","ahn_km@seoreu.com"],
    [2022012101,"주정우","개발","책임연구원","veryju@gmail.com"],
    [2022030201,"이주희","운영","과장","lee_jh@seoreu.com"],
    [2022050101,"이예슬","기획","사원","lee_ys@seoreu.com"],
    [2022050102,"유승균","개발","연구원","yoon_sg@seoreu.com"],
    [2022052503,"심규리","아르바이트","아르바이트","kury0202@naver.com"],
    [2022060203,"김지운","개발","연구원","kim_jw@seoreu.com"],
    [2022061601,"권정하","아르바이트","아르바이트","everwjdgk@naver.com"],
    [2022070101,"박혜린","아르바이트","아르바이트","cnsgid1995@naver.com"],
    [2022071401,"양승희","아르바이트","아르바이트","hui_01@naver.com"],
    [2022071403,"황혜성","아르바이트","아르바이트","hyesung9818@naver.com"],
    [2022080101,"조준영","아르바이트","아르바이트","whwnsdud21@naver.com"],
    [2022090201,"이세란","아르바이트","아르바이트","ranse0388@gmail.com"],
    [2022090202,"전현영","아르바이트","아르바이트","pipi0331@naver.com"],
]

for user in user_list:
    print(user)
    try:
        result=create.user(db=db_session,employee_number=str(user[0]),name=user[1],department=user[2],position=user[3],email=user[4],join_user="seoreu@seoreu.com")
        print(result)
    except Exception as e:
        print(e)